Проприетарный проект, реализующий систему учета рабочего времени и пропускного контроля.
Мои задачи в проекте были:
   - создать клиент-серверное решение для программирования пропусков;
   - написать клиентское приложение под Андроид:
       - чтение данных с NFC карт;
       - запись данных на NFC карты;
       - написать UI для добавления, удаления и изменения данных на пропусках (NFC картах);
       - написать UI для получения информации о рабочем времени сотрудников;
       - создать функционал для подключения приложения к серверному ПО.
   - написать серверное ПО:
       - работа с базами данных (БД) MySQL и MongoDB;
       - создать методы сохранения, изменения, удаления, шифрования данных;
       - написать WEB API.
   - установка сервера;
   - настройка сервера;
   - настройка сети;
   - настройка внутреннего DNS;
   - настройка ssl сертификатов;
   - настройка Apache Web Server в качестве программного прокси.
   
В целом суть андроид приложения была в том, чтобы дать начальникам отделов возможность самостоятельно настраивать пропуска, а так же получать оперативную информацию о времени прихода, ухода сотрудников. Необходимость делать данную систему клиент-серверной заключалась в том, что разные отделы компании физически находились в разных местах.
